# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#   brew bundle --file="${HOME_DOTFILES}/home/.Brewfile" --verbose
#
#   brew bundle --global --verbose

brew "zsh"

brew "vim"
brew "tmux"
brew "mc"
brew "htop"
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "readline"

brew "git"
brew "git-lfs"
brew "git-gui"
brew "git-cola"

brew "awscli"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
#cask_args appdir: "~/Applications"

cask "font-fira-code"
cask "font-fira-mono"
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }

# https://github.com/mas-cli/mas
brew "mas"
mas "1Password", id: 1333542190

# https://github.com/whalebrew/whalebrew
brew "whalebrew"
#whalebrew "whalebrew/wget"

# clojure
brew "leiningen"
brew "clojure"
brew "rlwrap"

# scripting
brew "python"
brew "python@3.8"
brew "ruby"

# Android
brew "gradle"
brew "ktlint"
brew "pidcat"

# programming - general
brew "awscli"
brew "tfenv"
brew "pre-commit"
brew "asciidoc"
brew "asciidoctor"
# asciidoctor **/*.adoc
brew "fswatch"
# fswatch -o **/*.adoc | xargs -n1 -I{} asciidoctor **/*.adoc
brew "httpie"

# utils
brew "speedtest-cli"
brew "youtube-dl"

# programming visual
cask "dash"
