# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#   brew bundle --global --verbose

brew "zsh"

brew "vim"
brew "tmux"
brew "mc"
brew "wget"
brew "curl"
brew "jq"

brew "git"
brew "git-lfs"
brew "git-cola"

brew "awscli"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
#cask_args appdir: "~/Applications"

cask "font-fira-code"
cask "font-fira-mono"
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }

# https://github.com/mas-cli/mas
brew "mas"
mas "1Password", id: 1333542190

# https://github.com/whalebrew/whalebrew
brew "whalebrew"
#whalebrew "whalebrew/wget"

brew "leiningen"
brew "clojure"
